import re

text_list = ['Пажалуста принесите\nводы и идите спать. анон\nАдмину шоколадку',
             'Привет. Назовите все!!!\nЕсли нет ,то что делать-то???!)']

for text in text_list:
    print(text)
    for bad_words in [
        "Админ разместите анонимно объявление, спасибо. ",
        "Админ пропусти",
        "админу добра",
        "админ ",
        "Админу",
        "Не анонимно",
        "анонимно",
        "ананимно",
        "ананимна",
        "аноним",
        "Не анон",
        "неанон",
        "Анон",
        "анон.",
        "анон",
        "пожалуйста",
        "пожалуйсто",
        "пожалуста",
        "()",
        "(, )",
        "( )"
    ]:
        text = text.replace(bad_words, ' ')

    print(text)
    text = re.sub(r'\s', ' ', text)
    print(text)
    text = re.sub(r'\s+', ' ', text)
    print(text)
    print('____Следующий текст:')

